# BuiltInFailures.ExportFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExportFailures Class
BuiltInFailures Class Members See Also
---
Failures about ExportFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ExportFailures
```

Visual Basic
---
```text
Public NotInheritable Class ExportFailures
```

Visual C++
---
```text
public ref class ExportFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ExportFailures
# See Also
BuiltInFailures..::..ExportFailures Members
Autodesk.Revit.DB Namespace